Revit 2027 API
TypeBinding Properties
The TypeBinding type exposes the following members.
Properties
Name | Description
Categories | Retrieve or set the categories to which a parameter definition will be bound.
(Inherited from ElementBinding)
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
See Also
Reference
TypeBinding Class
Autodesk.Revit.DB Namespace